21-rails-session/app/controllers/nachos_controller.rb

SELECT "nachos".* FROM "nachos"
---
  def index # /nachos
    @nachos = Nacho.all

SELECT  "nachos".* FROM "nachos" WHERE "nachos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def find_nacho
    @nacho = Nacho.find(params[:id])